/*
 Напишите программу, в которой вычисляется сумма чисел, удовлетворяющих таким критериям:
 при делении числа на 5 в остатке получается 2, или при делении на 3 в остатке получается 1.
 Количество чисел в сумме вводится пользователем.
 Программа отображает числа, которые суммируются, и значение суммы. Используйте обработку исключений.
 */
using System;

class Program
{
    static void Main(string[] args)
    {
        Console.Write("Введите целое число и узнаете какие числа\nдо него дают в остатке 2 при делении на 5 или 1 при делении на 3 и их сумму: ");
        try
        {
            double num = double.Parse(Console.ReadLine());
            double sum = 0;
            for (double i = 0; i <= num; i++)
            {
                if (i % 5 == 2 || i % 3 == 1)
                {
                    Console.Write($"{i} ");
                    sum += i;
                }
            }
            Console.Write($"сумма данных чисел равна {sum}");
        }
        catch(Exception e)
        {
            Console.WriteLine(e.Message);
        }
        Console.ReadKey();
    }
}