/*
 Напишите программу с классом, у которого есть неотрицательное целочисленное поле. В классе нужно
 описать индексатор с целочисленным индексом и set-аксессором. Присваивание значения проиндексированному объекту
 обрабатывается следующим образом. В фактически присваиваемом значении  берется только последняя цифра (остаток от деления на число 10).
 Индекс определяет разряд в числовом значении поля, в который записывается цифра. Нулевой разряд соответствует единицам, единичный разряд соответствует десяткам, 
 разряд два соответствует сотням и так далее. Например, если объект проиндексирован числом 1 и присваивается значение, заканчивающееся на 5, то это означает что,
 в числе, которое является значением поля, в разряд десятков (разряд 1) нужно записать цифру 5.
 */
using System;
class MyClass
{
    private uint num;
    public MyClass(uint num)
    {
        this.num = num;
    }
    public uint show
    {
        get
        {
            return num;
        }
    }
    public uint this[int n]
    {
        set
        {
            uint val = value % 10;
            String res = "";
            String txt = "" + num;
            for (int i = 0; i < n; i++)
            {
                res += txt[i];
            }
            res += val;
            for (int i = n + 1; i < txt.Length; i++)
            {
                res += txt[i];
            }
            num = uint.Parse(res);
        }
    }
}
class Program
{
    static void Main(string[] args)
    {
        MyClass A = new MyClass(123456);
        Console.WriteLine(A.show);
        A[3] = 9;
        Console.WriteLine(A.show);
        Console.ReadKey();
    }
}