/*
 Напишите программу, в которой вычисляется сумма чисел, которые вводит пользователь.
 Программа выводит запрос на ввод числа, считывает введенное пользователем число, прибавляет его к сумме
 и снова выводит запрос на ввод числа. Процесс продолжается до тех пор, пока пользователь не введет нулевое значение.
 Используйте обработку исключений.
 */
using System;

class Program
{
    static void Main(string[] args)
    {
        long sum = 0;
        try
        {
            while (true)
            {
                Console.Write("Введите целое число и узнаете сумму введенного числа\n" +
                    "и всех чисел введенных до него(для выхода из программы введите 0): ");
                long num = long.Parse(Console.ReadLine());
                if (num == 0) break;
                sum += num;
                Console.WriteLine($"Сумма всех введенных чисел равна: {sum}");
            }
        }
        catch { Console.WriteLine("Вы ввели не целое число!"); }
        Console.WriteLine("Bye Bye!");
        Console.ReadKey();
    }
}

